young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_code_slotB/libraries/drivers/inc/at32f422_426_crm.h
/**
  * @brief crm auto step mode
  */
typedef enum
{
  CRM_AUTO_STEP_MODE_DISABLE             = 0x00, /*!< disable auto step mode */
  CRM_AUTO_STEP_MODE_ENABLE              = 0x03  /*!< enable auto step mode */
} crm_auto_step_mode_type;

/**
  * @brief crm can index
  */
typedef enum
{
  CRM_CAN1                               = 0x00  /*!< can1 */
} crm_can_type;

/**
  * @brief crm can clock source
  */
typedef enum
{
  CRM_CAN_CLOCK_SOURCE_HEXT              = 0x00, /*!< select hext clock as can clock source */
  CRM_CAN_CLOCK_SOURCE_PLL               = 0x01, /*!< select pll clock as can clock source */
  CRM_CAN_CLOCK_SOURCE_PCLK              = 0x02  /*!< select high speed external clock as can clock source */
} crm_can_clock_source_type;

/**
  * @brief crm hick as system clock frequency select
  */
typedef enum
{
  CRM_HICK_SCLK_8MHZ                     = 0x00, /*!< fixed 8 mhz when hick is selected as sclk */
  CRM_HICK_SCLK_48MHZ                    = 0x01  /*!< 8 mhz or 48 mhz depend on hickdiv when hick is selected as sclk */
} crm_hick_sclk_frequency_type;

/**
  * @brief crm external crystal driving strength
  */
typedef enum
{
  CRM_DRV_STRENGTH_LOW                   = 0x00, /*!< driving strength low */
  CRM_DRV_STRENGTH_MEDIUM_LOW            = 0x01, /*!< driving strength medium low */
  CRM_DRV_STRENGTH_MEDIUM_HIGH           = 0x02, /*!< driving strength medium high */
  CRM_DRV_STRENGTH_HIGH                  = 0x03  /*!< driving strength high */
} crm_drv_strength_type;

/**
  * @brief crm clocks freqency structure
  */
typedef struct
{
  uint32_t sclk_freq; /*!< system clock frequency */
  uint32_t ahb_freq;  /*!< ahb bus clock frequency */
  uint32_t apb2_freq; /*!< apb2 bus clock frequency */
  uint32_t apb1_freq; /*!< apb1 bus clock frequency */
  uint32_t adc_freq;  /*!< adc clock frequency */
} crm_clocks_freq_type;

/**
  * @brief type define crm register all
  */
typedef struct
{
  /**
    * @brief crm ctrl register, offset:0x00
    */
  union
  {
    __IO uint32_t ctrl;
    struct
    {
      __IO uint32_t hicken               : 1; /* [0] */
      __IO uint32_t hickstbl             : 1; /* [1] */
      __IO uint32_t hicktrim             : 6; /* [7:2] */
      __IO uint32_t hickcal              : 8; /* [15:8] */
      __IO uint32_t hexten               : 1; /* [16] */
      __IO uint32_t hextstbl             : 1; /* [17] */
      __IO uint32_t hextbyps             : 1; /* [18] */
      __IO uint32_t cfden                : 1; /* [19] */
      __IO uint32_t reserved1            : 4; /* [23:20] */
      __IO uint32_t pllen                : 1; /* [24] */
      __IO uint32_t pllstbl              : 1; /* [25] */
      __IO uint32_t reserved2            : 6; /* [31:26] */
    } ctrl_bit;
  };

  /**
    * @brief crm cfg register, offset:0x04
    */
  union
  {
    __IO uint32_t cfg;
    struct
    {
      __IO uint32_t sclksel              : 2; /* [1:0] */
      __IO uint32_t sclksts              : 2; /* [3:2] */
      __IO uint32_t ahbdiv               : 4; /* [7:4] */
      __IO uint32_t apb1div              : 3; /* [10:8] */
      __IO uint32_t apb2div              : 3; /* [13:11] */
      __IO uint32_t adcdiv_l             : 2; /* [15:14] */
      __IO uint32_t pllrcs               : 1; /* [16] */
      __IO uint32_t pllhextdiv           : 1; /* [17] */
      __IO uint32_t pllmult_l            : 4; /* [21:18] */
      __IO uint32_t reserved1            : 2; /* [23:22] */
      __IO uint32_t clkout_sel           : 3; /* [26:24] */
      __IO uint32_t reserved2            : 1; /* [27] */
      __IO uint32_t adcdiv_h             : 1; /* [28] */
      __IO uint32_t pllmult_h            : 2; /* [30:29] */
      __IO uint32_t reserved3            : 1; /* [31] */
    } cfg_bit;
  };

  /**
    * @brief crm clkint register, offset:0x08
    */
  union
  {
    __IO uint32_t clkint;
    struct
    {
      __IO uint32_t lickstblf            : 1; /* [0] */
      __IO uint32_t lextstblf            : 1; /* [1] */
      __IO uint32_t hickstblf            : 1; /* [2] */
      __IO uint32_t hextstblf            : 1; /* [3] */
      __IO uint32_t pllstblf             : 1; /* [4] */
      __IO uint32_t reserved1            : 2; /* [6:5] */
      __IO uint32_t cfdf                 : 1; /* [7] */
      __IO uint32_t lickstblien          : 1; /* [8] */
      __IO uint32_t lextstblien          : 1; /* [9] */
      __IO uint32_t hickstblien          : 1; /* [10] */
      __IO uint32_t hextstblien          : 1; /* [11] */
      __IO uint32_t pllstblien           : 1; /* [12] */
      __IO uint32_t reserved2            : 3; /* [15:13] */
      __IO uint32_t lickstblfc           : 1; /* [16] */
      __IO uint32_t lextstblfc           : 1; /* [17] */
      __IO uint32_t hickstblfc           : 1; /* [18] */
      __IO uint32_t hextstblfc           : 1; /* [19] */
      __IO uint32_t pllstblfc            : 1; /* [20] */
      __IO uint32_t reserved3            : 2; /* [22:21] */
      __IO uint32_t cfdfc                : 1; /* [23] */
      __IO uint32_t reserved4            : 8; /* [31:24] */
    } clkint_bit;
  };

  /**
    * @brief crm apb2rst register, offset:0x0C
    */
  union
  {
    __IO uint32_t apb2rst;
    struct
    {
      __IO uint32_t scfgcmprst           : 1; /* [0] */
      __IO uint32_t exintrst             : 1; /* [1] */
      __IO uint32_t reserved1            : 7; /* [8:2] */
      __IO uint32_t adc1rst              : 1; /* [9] */
      __IO uint32_t reserved2            : 1; /* [10] */
      __IO uint32_t tmr1rst              : 1; /* [11] */
      __IO uint32_t spi1rst              : 1; /* [12] */
      __IO uint32_t reserved3            : 1; /* [13] */
      __IO uint32_t usart1rst            : 1; /* [14] */
      __IO uint32_t reserved4            : 1; /* [15] */
      __IO uint32_t tmr15rst             : 1; /* [16] */
      __IO uint32_t tmr16rst             : 1; /* [17] */
      __IO uint32_t tmr17rst             : 1; /* [18] */
      __IO uint32_t reserved5            : 13;/* [31:19] */
    } apb2rst_bit;
  };

  /**
    * @brief crm apb1rst register, offset:0x10
    */
  union
  {
    __IO uint32_t apb1rst;
    struct
    {
      __IO uint32_t reserved1            : 1; /* [0] */
      __IO uint32_t tmr3rst              : 1; /* [1] */
      __IO uint32_t reserved2            : 2; /* [3:2] */
      __IO uint32_t tmr6rst              : 1; /* [4] */
      __IO uint32_t reserved3            : 3; /* [7:5] */
      __IO uint32_t tmr14rst             : 1; /* [8] */
      __IO uint32_t reserved4            : 2; /* [10:9] */
      __IO uint32_t wwdtrst              : 1; /* [11] */
      __IO uint32_t reserved5            : 2; /* [13:12] */
      __IO uint32_t spi2rst              : 1; /* [14] */
      __IO uint32_t reserved6            : 2; /* [16:15] */
      __IO uint32_t usart2rst            : 1; /* [17] */
      __IO uint32_t reserved7            : 3; /* [20:18] */
      __IO uint32_t i2c1rst              : 1; /* [21] */
      __IO uint32_t i2c2rst              : 1; /* [22] */
      __IO uint32_t reserved8            : 2; /* [24:23] */
      __IO uint32_t can1rst              : 1; /* [25] */
      __IO uint32_t reserved9            : 2; /* [27:26] */
      __IO uint32_t pwcrst               : 1; /* [28] */
      __IO uint32_t reserved10           : 3; /* [31:29] */
    } apb1rst_bit;
  };

  /**
    * @brief crm ahben register, offset:0x14
    */
  union
  {
    __IO uint32_t ahben;
    struct
    {
      __IO uint32_t dma1en               : 1; /* [0] */
      __IO uint32_t reserved1            : 1; /* [1] */
      __IO uint32_t sramen               : 1; /* [2] */
      __IO uint32_t reserved2            : 1; /* [3] */
      __IO uint32_t flashen              : 1; /* [4] */
      __IO uint32_t reserved3            : 1; /* [5] */
      __IO uint32_t crcen                : 1; /* [6] */
      __IO uint32_t reserved4            : 10;/* [16:7] */
      __IO uint32_t gpioaen              : 1; /* [17] */
      __IO uint32_t gpioben              : 1; /* [18] */
      __IO uint32_t gpiocen              : 1; /* [19] */
      __IO uint32_t reserved5            : 2; /* [21:20] */
      __IO uint32_t gpiofen              : 1; /* [22] */
      __IO uint32_t reserved6            : 9; /* [31:23] */
    } ahben_bit;
  };

  /**
    * @brief crm apb2en register, offset:0x18
    */
  union
  {
    __IO uint32_t apb2en;
    struct
    {
      __IO uint32_t scfgcmpen            : 1; /* [0] */
      __IO uint32_t reserved1            : 8; /* [8:1] */
      __IO uint32_t adc1en               : 1; /* [9] */
      __IO uint32_t reserved2            : 1; /* [10] */
      __IO uint32_t tmr1en               : 1; /* [11] */
      __IO uint32_t spi1en               : 1; /* [12] */
      __IO uint32_t reserved3            : 1; /* [13] */
      __IO uint32_t usart1en             : 1; /* [14] */
      __IO uint32_t reserved4            : 1; /* [15] */
      __IO uint32_t tmr15en              : 1; /* [16] */
      __IO uint32_t tmr16en              : 1; /* [17] */
      __IO uint32_t tmr17en              : 1; /* [18] */
      __IO uint32_t reserved5            : 13;/* [31:19] */
    } apb2en_bit;
  };

  /**
    * @brief crm apb1en register, offset:0x1C
    */
  union
  {
    __IO uint32_t apb1en;
    struct
    {
      __IO uint32_t reserved1            : 1; /* [0] */
      __IO uint32_t tmr3en               : 1; /* [1] */
      __IO uint32_t reserved2            : 2; /* [3:2] */
      __IO uint32_t tmr6en               : 1; /* [4] */
      __IO uint32_t reserved3            : 3; /* [7:5] */
      __IO uint32_t tmr14en              : 1; /* [8] */
      __IO uint32_t reserved4            : 2; /* [10:9] */
      __IO uint32_t wwdten               : 1; /* [11] */
      __IO uint32_t reserved5            : 2; /* [13:12] */
      __IO uint32_t spi2en               : 1; /* [14] */
      __IO uint32_t reserved6            : 2; /* [16:15] */
      __IO uint32_t usart2en             : 1; /* [17] */
      __IO uint32_t reserved7            : 3; /* [20:18] */
      __IO uint32_t i2c1en               : 1; /* [21] */
      __IO uint32_t i2c2en               : 1; /* [22] */
      __IO uint32_t reserved8            : 2; /* [24:23] */
      __IO uint32_t can1en               : 1; /* [25] */
      __IO uint32_t reserved9            : 2; /* [27:26] */
      __IO uint32_t pwcen                : 1; /* [28] */
      __IO uint32_t reserved10           : 3; /* [31:29] */
    } apb1en_bit;
  };

  /**
    * @brief crm bpdc register, offset:0x20
    */
  union
  {
    __IO uint32_t bpdc;
    struct
    {
      __IO uint32_t lexten               : 1; /* [0] */
      __IO uint32_t lextstbl             : 1; /* [1] */
      __IO uint32_t lextbyps             : 1; /* [2] */
      __IO uint32_t lextdrv              : 2; /* [4:3] */
      __IO uint32_t reserved1            : 3; /* [7:5] */
      __IO uint32_t ertcsel              : 2; /* [9:8] */
      __IO uint32_t reserved2            : 5; /* [14:10] */
      __IO uint32_t ertcen               : 1; /* [15] */
      __IO uint32_t bpdrst               : 1; /* [16] */
      __IO uint32_t reserved3            : 15;/* [31:17] */
    } bpdc_bit;
  };

  /**
    * @brief crm ctrlsts register, offset:0x24
    */
  union
  {
    __IO uint32_t ctrlsts;
    struct
    {
      __IO uint32_t licken               : 1; /* [0] */
      __IO uint32_t lickstbl             : 1; /* [1] */
      __IO uint32_t reserved1            : 22;/* [23:2] */
      __IO uint32_t rstfc                : 1; /* [24] */
      __IO uint32_t reserved2            : 1; /* [25] */
      __IO uint32_t nrstf                : 1; /* [26] */
      __IO uint32_t porrstf              : 1; /* [27] */
      __IO uint32_t swrstf               : 1; /* [28] */
      __IO uint32_t wdtrstf              : 1; /* [29] */
      __IO uint32_t wwdtrstf             : 1; /* [30] */
      __IO uint32_t lprstf               : 1; /* [31] */
    } ctrlsts_bit;
  };

  /**
    * @brief crm ahbrst register, offset:0x28
    */
  union
  {
    __IO uint32_t ahbrst;
    struct
    {
      __IO uint32_t reserved1            : 17;/* [16:0] */
      __IO uint32_t gpioarst             : 1; /* [17] */
      __IO uint32_t gpiobrst             : 1; /* [18] */
      __IO uint32_t gpiocrst             : 1; /* [19] */
      __IO uint32_t reserved2            : 2; /* [21:20] */
      __IO uint32_t gpiofrst             : 1; /* [22] */
      __IO uint32_t reserved3            : 9; /* [31:23] */
    } ahbrst_bit;
  };

  /**
    * @brief crm pll register, offset:0x2C
    */
  union
  {
    __IO uint32_t pll;
    struct
    {
      __IO uint32_t pllfr                : 3; /* [2:0] */
      __IO uint32_t reserved1            : 1; /* [3] */
      __IO uint32_t pllms                : 4; /* [7:4] */
      __IO uint32_t pllns                : 9; /* [16:8] */
      __IO uint32_t reserved2            : 7; /* [23:17] */
      __IO uint32_t pllfref              : 3; /* [26:24] */
      __IO uint32_t reserved3            : 4; /* [30:27] */
      __IO uint32_t pllcfgen             : 1; /* [31] */
    } pll_bit;
  };

  /**
    * @brief crm misc1 register, offset:0x30
    */
  union
  {
    __IO uint32_t misc1;
    struct
    {
      __IO uint32_t hickcal_key          : 8; /* [7:0] */
      __IO uint32_t reserved1            : 8; /* [15:8] */
      __IO uint32_t clkout_sel           : 1; /* [16] */
      __IO uint32_t reserved2            : 3; /* [19:17] */
      __IO uint32_t clkflashsrc          : 1; /* [20] */
      __IO uint32_t reserved3            : 4; /* [24:21] */
      __IO uint32_t hickdiv              : 1; /* [25] */
      __IO uint32_t reserved4            : 2; /* [27:26] */
      __IO uint32_t clkoutdiv            : 4; /* [31:28] */
    } misc1_bit;
  };

  /**
    * @brief crm reserved2 register, offset:0x50~0x34
    */
  __IO uint32_t reserved2[8];

  /**
    * @brief crm misc2 register, offset:0x54
    */
  union
  {
    __IO uint32_t misc2;
    struct
    {
      __IO uint32_t reserved1            : 4; /* [3:0] */
      __IO uint32_t auto_step_en         : 2; /* [5:4] */
      __IO uint32_t reserved2            : 3; /* [8:6] */
      __IO uint32_t hick_to_sclk         : 1; /* [9] */
      __IO uint32_t reserved3            : 2; /* [11:10] */
      __IO uint32_t apb3div              : 3; /* [14:12] */
      __IO uint32_t reserved4            : 7; /* [21:15] */
      __IO uint32_t hextdrv              : 2; /* [23:22] */
      __IO uint32_t vbathdiv             : 2; /* [25:24] */
      __IO uint32_t reserved5            : 6; /* [31:26] */
    } misc2_bit;
  };

  /**
    * @brief crm reserved3 register, offset:0x58~0x64
    */
  __IO uint32_t reserved3[4];

  /**
    * @brief crm piclks register, offset:0x68
    */
  union
  {
    __IO uint32_t piclks;
    struct
    {
      __IO uint32_t ertc_pclksel         : 1; /* [0] */
      __IO uint32_t reserved1            : 23;/* [23:1] */
      __IO uint32_t can1sel              : 2; /* [25:24] */
      __IO uint32_t reserved2            : 6; /* [31:26] */
    } piclks_bit;
  };

